# solution

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('quize_pandas')

In [3]:
data.head(5)

   Customer Product Model  Count    Volume
0  CI100019     P03   M01   21.0       NaN
1  CI100028     P01   M02    9.0       NaN
2  CI100019     P01   M02    9.0       NaN
3  CI100019     P02   M03    NaN  1.370358
4  CI100019     P03   M02   61.0       NaN

# Question1

با استفاده از دادگان ارائه شده محاسبه کنید هر مشتری چند درصد از هر محصول را خریده است. (با دقت دهگان درصد)

In [4]:
def column_mapping_function(column):
    return column.map(lambda item: round(item/column.sum() * 100, -1) if column.sum() != 0 else None)

In [5]:
cpm_p_table = pd.pivot_table(data, index="Customer", columns=["Product", "Model"], values=["Count", "Volume"], aggfunc={"Count": "sum", "Volume": "sum"}).apply(column_mapping_function).dropna(axis = 1, how = 'all')

In [6]:
cpm_p_table

          Count                               Volume
Product     P01               P03                P02
Model       M01   M02   M03   M01   M02   M03    M01   M02   M03
Customer
CI100019    NaN  70.0  80.0  20.0  40.0  60.0    NaN  40.0  10.0
CI100021  100.0   NaN  20.0  40.0  30.0  40.0   10.0  20.0  50.0
CI100028    NaN  30.0   NaN  40.0  20.0   NaN   90.0  30.0  40.0

# Question2

به هر سطر لیست دادگان میزان کل محصول خریداری شده اضافه کنید و بنا به شماره مشتری، محصول و مدل مرتب کنید

In [7]:
def group_mapping_function(group):
    group["Count_total"] = group.Count.agg("sum")
    group["Volume_total"] = group.Volume.agg("sum")
    return group

In [8]:
ordered_list_sorted = data.groupby(["Product", "Model"], group_keys=False).apply(group_mapping_function).sort_values(["Customer", "Product", "Model"])
ordered_list_sorted = ordered_list_sorted.set_index(["Customer", "Product", "Model"])

In [9]:
ordered_list_sorted

                        Count    Volume  Count_total  Volume_total
Customer Product Model
CI100019 P01     M02      9.0       NaN         32.0      0.000000
                 M02     14.0       NaN         32.0      0.000000
                 M03     10.0       NaN         12.0      0.000000
         P02     M02      NaN  1.723917          0.0      3.838595
                 M03      NaN  1.370358          0.0     11.298089
         P03     M01     21.0       NaN        104.0      0.000000
                 M02     61.0       NaN        337.0      0.000000
                 M02     81.0       NaN        337.0      0.000000
                 M03     51.0       NaN         92.0      0.000000
CI100021 P01     M01      1.0       NaN          1.0      0.000000
                 M03      2.0       NaN         12.0      0.000000
         P02     M01      NaN  0.427100          0.0      7.562549
                 M02      NaN  0.948237          0.0      3.838595
                 M03      NaN  3.607547          0.0     11.298089
                 M03      NaN  1.910294          0.0     11.298089
         P03     M01     31.0       NaN        104.0      0.000000
                 M01     11.0       NaN        104.0      0.000000
                 M02     31.0       NaN        337.0      0.000000
                 M02     31.0       NaN        337.0      0.000000
                 M02     51.0       NaN        337.0      0.000000
                 M03     41.0       NaN         92.0      0.000000
CI100028 P01     M02      9.0       NaN         32.0      0.000000
         P02     M01      NaN  5.455363          0.0      7.562549
                 M01      NaN  1.680085          0.0      7.562549
                 M02      NaN  0.267710          0.0      3.838595
                 M02      NaN  0.898730          0.0      3.838595
                 M03      NaN  3.574533          0.0     11.298089
                 M03      NaN  0.835356          0.0     11.298089
         P03     M01     41.0       NaN        104.0      0.000000
                 M02     11.0       NaN        337.0      0.000000
                 M02     71.0       NaN        337.0      0.000000

# Question3

دیتای زیر را برای افراد ۱۸ سال و به بالا بر اساس ستون درصدمرتب کرده تا به شکل نهایی نشان داده شده برسد

In [10]:
import pandas as pd

record = {

'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
'Age': [21, 19, 20, 18, 17, 21],
'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
'Percentage': [88, 92, 95, 70, 65, 78] }

# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])

dataframe

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [11]:
df = dataframe[dataframe.Age >= 18].sort_values("Percentage", ascending=False, ignore_index=True)
df.rename(columns={"Name": "Firstname", "Percentage": "Percentage_sorted"}, index= lambda index: chr(ord('A') + index), inplace=True)

In [12]:
df

   Firstname  Age    Stream  Percentage_sorted
A  Aishwarya   20   Science                 95
B       Amit   19  Commerce                 92
C      Ankit   21      Math                 88
D    Shaurya   21   Science                 78
E   Priyanka   18      Math                 70